In [1]:
#Imports
import pandas as pd
import numpy as np
from scipy import stats
from pydataset import data
from env import get_connection

## Exercise 1

Answer with the type of stats test you would use (assume normal distribution):

Do students get better test grades if they have a rubber duck on their desk?  
1-tailed t-test

Does smoking affect whether or not someone has lung cancer?  
Chi^2

Is gender independent of a personâ€™s blood type?  
Chi^2

A farming company wants to know if a new fertilizer has improved crop yield or not  
Probably t-test, Adam please change this question for future classes

Does the length of time of the lecture correlate with a students grade?  
Correlation test (pearsonr)

Do people with dogs live in apartments more than people with cats?  
Chi^2

## Exercise 2

Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

Null: using a macbook and being a Codeup student are independent of each other  
Alternative: using a macbook and being a Codeup student are NOT independent of each other

In [2]:
#Create dataframe
df = pd.DataFrame({'Codeup student': [49, 1], 'Not Codeup student': [20, 30]})
df

   Codeup student  Not Codeup student
0              49                  20
1               1                  30

In [3]:
#Set index
df.index = ['Mac user', 'Not mac user']
df

              Codeup student  Not Codeup student
Mac user                  49                  20
Not mac user               1                  30

In [4]:
#Run chi2 test
chi2, p, degf, expected = stats.chi2_contingency(df)
chi2, p

(36.65264142122487, 1.4116760526193828e-09)

In [5]:
#Evaluate against alpha
alpha = 0.05

if p < alpha:
    print('Reject the null')
else:
    print('Fail to reject the null')

Reject the null

## Exercise 3

Choose another 2 categorical variables from the mpg dataset and perform a chi^2 contingency table test with them. Be sure to state your null and alternative hypotheses.

Null: there is no relationship between transmission type and car class  
Alternative: there is a relationship between transmission type and car class

In [6]:
#Read in dataset
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [7]:
#Categorize cars as automatic or manual using startswith
mpg['trans'].str.startswith('a')

1       True
2      False
3      False
4       True
5       True
       ...
230     True
231    False
232     True
233    False
234     True
Name: trans, Length: 234, dtype: bool

In [8]:
#Use np.where, syntax is np.where(condition, output if yes, output if no)
np.where(mpg['trans'].str.startswith('a'), 'Auto', 'Manual')

array(['Auto', 'Manual', 'Manual', 'Auto', 'Auto', 'Manual', 'Auto',
       'Manual', 'Auto', 'Manual', 'Auto', 'Auto', 'Manual', 'Auto',
       'Manual', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto',
       'Auto', 'Manual', 'Auto', 'Manual', 'Auto', 'Manual', 'Auto',
       'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto',
       'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto',
       'Auto', 'Auto', 'Auto', 'Manual', 'Auto', 'Auto', 'Manual', 'Auto',
       'Auto', 'Auto', 'Manual', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto',
       'Auto', 'Auto', 'Auto', 'Manual', 'Auto', 'Auto', 'Auto', 'Manual',
       'Manual', 'Auto', 'Manual', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto',
       'Auto', 'Manual', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Manual',
       'Manual', 'Auto', 'Auto', 'Auto', 'Auto', 'Manual', 'Auto',
       'Manual', 'Auto', 'Auto', 'Manual', 'Manual', 'Auto', 'Manual',
       'Manual', 'Auto', 'Manual', 'Manual', 'Auto', 'Manual', 'Auto',
       'Auto', 'Manual', 'Auto', 'Manual', 'Auto', 'Manual', 'Auto',
       'Manual', 'Auto', 'Auto', 'Manual', 'Manual', 'Auto', 'Auto',
       'Manual', 'Manual', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto',
       'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto',
       'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Manual', 'Auto', 'Auto',
       'Manual', 'Manual', 'Auto', 'Auto', 'Manual', 'Auto', 'Auto',
       'Manual', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto', 'Auto',
       'Manual', 'Auto', 'Manual', 'Manual', 'Auto', 'Auto', 'Auto',
       'Manual', 'Manual', 'Auto', 'Auto', 'Auto', 'Manual', 'Manual',
       'Manual', 'Auto', 'Auto', 'Manual', 'Auto', 'Auto', 'Manual',
       'Auto', 'Manual', 'Auto', 'Auto', 'Manual', 'Auto', 'Auto',
       'Manual', 'Manual', 'Auto', 'Auto', 'Manual', 'Auto', 'Auto',
       'Auto', 'Manual', 'Manual', 'Auto', 'Auto', 'Auto', 'Manual',
       'Auto', 'Manual', 'Manual', 'Auto', 'Manual', 'Auto', 'Manual',
       'Auto', 'Manual', 'Auto', 'Manual', 'Manual', 'Manual', 'Auto',
       'Auto', 'Manual', 'Auto', 'Manual', 'Auto', 'Manual', 'Manual',
       'Auto', 'Manual', 'Auto', 'Manual', 'Auto', 'Manual', 'Auto',
       'Auto', 'Manual', 'Auto', 'Manual', 'Auto'], dtype='<U6')

In [9]:
#Create new simplified transmission column
mpg['trans_simple'] = np.where(mpg['trans'].str.startswith('a'), 'Auto', 'Manual')
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,trans_simple
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,Auto
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,Manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,Manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,Auto
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,Auto

In [10]:
#Create crosstab
pd.crosstab(mpg['class'], mpg['trans_simple'])

trans_simple  Auto  Manual
class
2seater          2       3
compact         24      23
midsize         29      12
minivan         11       0
pickup          20      13
subcompact      16      19
suv             55       7

In [11]:
#Run chi2 test
chi2, p, degf, expected = stats.chi2_contingency(pd.crosstab(mpg['class'], mpg['trans_simple']))
chi2, p

(33.7700251570052, 7.4513729838250925e-06)

In [12]:
#Evaluate against alpha
alpha = 0.05

if p < alpha:
    print('Reject the null')
else:
    print('Fail to reject the null')

Reject the null

Please note that this chi2 test is not optimal! It represents a comparison between all seven different class types and transmission type. While we are able to conclude that class and transmission type are not independent of one another, we don't know which class(es) of car is/are responsible for the relationship. It would be beneficial to be more specific with the question, and evaluate one class of car against the rest.

## Exercise 4

Use the data from the employees database to answer these questions:

Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)  
Null: an employee's gender is independent of whether they work in sales or marketing  
Alternative: an employee's gender is NOT independent of which department they work in

Is an employee's gender independent of whether or not they are or have been a manager?  
Null: an employee's gender is independent of whether or not they have been a manager  
Alternative: an employee's gender is NOT independent of manager status

In [13]:
#Query to get current employees in the departments of interest
query = '''
        SELECT gender, dept_name
        FROM employees
        JOIN dept_emp USING(emp_no)
        JOIN departments USING(dept_no)
        WHERE to_date > CURDATE()
        AND dept_name IN ('Sales', 'Marketing');
        '''

In [14]:
#Generate the url
url = get_connection('employees')

In [15]:
#Read in the data
emp = pd.read_sql(query, url)
emp.head()

  gender  dept_name
0      F  Marketing
1      M  Marketing
2      F  Marketing
3      F  Marketing
4      F  Marketing

In [16]:
#Check to make sure data matches expectations
emp.value_counts()

gender  dept_name
M       Sales        22702
F       Sales        14999
M       Marketing     8978
F       Marketing     5864
dtype: int64

In [17]:
#Generate crosstab
pd.crosstab(emp['gender'], emp['dept_name'])

dept_name  Marketing  Sales
gender
F               5864  14999
M               8978  22702

In [18]:
#Run chi2 test
chi2, p, degf, expected = stats.chi2_contingency(pd.crosstab(emp['gender'], emp['dept_name']))
chi2, p

(0.3240332004060638, 0.5691938610810126)

In [19]:
#Evaluate against alpha
alpha = 0.05

if p < alpha:
    print('Reject the null')
else:
    print('Fail to reject the null')

Fail to reject the null

In [20]:
#Define query for second part of question
query = '''
        SELECT gender, dept_no
        FROM employees
        LEFT JOIN dept_manager USING(emp_no);
        '''

In [21]:
#Read in data
emp = pd.read_sql(query, url)
emp.head()

  gender dept_no
0      M    None
1      F    None
2      M    None
3      M    None
4      M    None

In [22]:
#Verify managers were captured in data
emp['dept_no'].isna().value_counts()

True     300000
False        24
Name: dept_no, dtype: int64

In [23]:
#Use np.where to generate binary output
np.where(emp['dept_no'].isna(), 'No', 'Yes')

array(['No', 'No', 'No', ..., 'No', 'No', 'No'], dtype='<U3')

In [24]:
#Create the column
emp['is_manager'] = np.where(emp['dept_no'].isna(), 'No', 'Yes')
emp.head()

  gender dept_no is_manager
0      M    None         No
1      F    None         No
2      M    None         No
3      M    None         No
4      M    None         No

In [25]:
#Create crosstab
pd.crosstab(emp['gender'], emp['is_manager'])

is_manager      No  Yes
gender
F           120038   13
M           179962   11

In [26]:
#Perform chi2 test
chi2, p, degf, expected = stats.chi2_contingency(pd.crosstab(emp['gender'], emp['is_manager']))
chi2, p

(1.4566857643547197, 0.22745818732810363)

In [27]:
#Evaluate against alpha
alpha = 0.05

if p < alpha:
    print('Reject the null')
else:
    print('Fail to reject the null')

Fail to reject the null